{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit2_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit2_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_16_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit2_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit2_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_17_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit2_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_14_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_15_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_12_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_13_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_10_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_11_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_8_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_9_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_6_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_7_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_4_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_5_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_2_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_3_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/conv0_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn0_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_sc_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_sc_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_sc_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_sc_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/global_avg_pool_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/dense_classifier_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/dense_classifier_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/bn_dense_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/bn_dense_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/predictions_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/predictions_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/mul", "op": "Mul", "input": ["inputs", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/mul", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn_data_1/batchnorm/add_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/relu0_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/conv0_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/bn0_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1_2/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/relu0_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1_2/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/pooling0_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_1_2/Pad"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/pooling0_1/MaxPool2d", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_2_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_2_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_sc_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_sc_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_2_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_3_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_3_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_3_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit1_sc_1/convolution"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_1/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_4_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_4_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_4_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_5_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_5_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_1_2/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_5_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage1_unit2_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_1/Add"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_1_2/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_6_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_6_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_sc_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_sc_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_6_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_7_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_7_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_2_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_7_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit1_sc_1/convolution"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_2_1/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_8_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_8_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_8_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_9_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_9_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_3_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_9_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage2_unit2_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_2_1/Add"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_3_1/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_10_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_10_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_sc_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_sc_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_10_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_11_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_11_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_4_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_11_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit1_sc_1/convolution"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_4_1/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_12_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_relu1_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_12_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_relu2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_12_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_conv1_1/convolution/merged_input", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_bn2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_13_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_relu2_1/Relu", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_13_1/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_5_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/zero_padding2d_13_1/Pad", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage3_unit2_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_4_1/Add"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/add_5_1/Add", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/resnet18_scene_classifier_1/functional_1/stage4_unit1_relu1_1/Relu", "op": "Relu", 